{
    "hymnNumber": 419,
    "title": "Christians, Awake, Salute the Happy Morn",
    "author": {
        "name": "John Byrom",
        "birthYear": 1692,
        "deathYear": 1763,
        "bio": "John Byrom was an English poet and inventor. He is known for his contributions to shorthand and for writing the Christmas hymn 'Christians, Awake, Salute the Happy Morn'."
    },
    "category": "Christmas",
    "lyrics": "CHRISTIANS, awake, salute the happy morn.\nWhereon the Saviour of the world was born;\nRise to adore the mystery of love,\nWhich hosts of Angels chanted from above;\nWith them the joyful tidings first begun\nOf God Incarnate and the Virgin's Son.\n\nThen to the watchful shepherds it was told,\nWho heard the Angelic herald's voice, \"Behold,\nI bring good tidings of a Saviour's birth\nTo you and all the nations upon earth:\nThis day hath God fulfilled His promised word,\nThis day is born a Saviour, Christ the Lord.\"\n\nHe spake, and straightway the celestial choir\nIn hymns of joy, unknown before, conspire:\nThe praises of redeeming love they sang,\nAnd Heav'n's whole orb with Alleluias rang:\nGod's highest glory was their anthem still,\nPeace upon earth, and unto men goodwill.\n\nTo Bethlehem straight the enlighten'd shepherds ran,\nTo see the wonder God had wrought for man,\nAnd found, with Joseph and the Blessed Maid,\nHer Son, the Saviour, in a manger laid;\nThen to their flocks, still praising God, return,\nAnd their glad hearts with holy rapture burn.\n\nO may we keep and ponder in our mind\nGod's wondrous love in saving lost mankind;\nTrace we the Babe, Who hath retrieved our loss,\nFrom His poor manger to His bitter Cross,\nTread in His steps, assisted by His grace,\nTill man's first heavenly state again takes place.\n\nThen may we hope, the Angelic hosts among,\nTo sing, redeem'd, a glad triumphal song:\nHe that was born upon this joyful day\nAround us all His glory shall display,\nSaved by His love, incessant we shall sing\nEternal praise to Heav'n's Almighty King."
}
